Tekla.Structures.Filtering.Categories.ObjectTypesFilterExpressions.CategoryName
The CategoryName class represents the category name filter expression.

Tekla.Structures.Filtering.Categories.ObjectTypesFilterExpressions.CategoryName.#ctor
Initializes a new instance of the CategoryName class.